/********************************************************************************
* 工程名称：底层驱动
* 文件名： Map.h
* 功能描述 ： MAP图管理模块头文件
* 引用记录：
* 备注：
* 修订记录：
*		日期		      版本		  作者		描述
*******************************************************************************/
#include "GlobalDef.h"

#include "Map.h"



#pragma CONST_SEG __GPAGE_SEG PARAMETERS_ROM1

volatile const HardwareMap_infoMap1S_TYPE HardwareMap_infoMap1S=
{
  1101,
  "ECD-105-156.000-02-00-E-010.001", //"ECD-000-001.000-01-00-I-010.001-010.001", //DataSet_idxVerUB_CA，底层数据当前版本
  "10.1", //DataSet_idxUserVerUB_CA[16],用户数据版本
  {
    0b11110000,0b11110100,0b11110100,0b11110100,0b11110100,0b11110000,0b11110000,0b11110000,0b11110000,0b11110000,0b11110000,0b11110000,0b11110000,0b11110000,0b11110000,0b11110000,0b11110000,0b11110000,0b11110000,0b11110000,
    0b11110000,0b11110000,0b11110000,0b11110000
  }, //ATDDrv_infoChanUB_CA，16个通道的AD配置情况
  {
    0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,
    20,21,22,23
  }, //ATDDrv_idxChanSigConfUB_CA，各个信号的通道配置
  {
    0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17
  }, //DIODrv_idxChanSigConfUB_CA，各个数字量输入的通道配置
  {
    1,1,1,1,1,1,1,0,0,1,1,0,0,1,0,0,0,0
  }, //高低有效软件可配置数字量输入通道高低有效配置
  18428, //高低有效软件可配通道的高电平电压门限
  4914, //高低有效软件可配置通道的低电平电压门限
  0, //PWMDrv_idxScaleAUB_C, PWM模块中时钟源A的分频数
  0, //PWMDrv_idxScaleBUB_C, PWM模块中时钟源B的分频数
  19, //PWMDrv_idxScaleSAUB_C, PWM模块中时钟源SA的分频数, fSA=fA/(2*N)
  19, //PWMDrv_idxScaleSBUB_C, PWM模块中时钟源SB的分频数, fSB=fB/(2*N)
  {
    1,1,1,1
  }, //PWMDrv_idxChanTimerConfUB_CA, PWM各通道所用时钟源, X0(PWM1)与X2(PWM5)使用A或SA, X1(PWM3)和X3(PWM7)使用B或SB
  {
    1,1,0,0
  }, //PWM通道的精度类型，0为要求宽频率范围,1为要求宽占空比范围
  {
    1,3,5,7
  }, //PWMDrv_idxFuncConfUB_CA, PWM模块中各功能所对应PWM管脚配置
  {
    0,1,2,3
  }, //PWM型低边驱动各任务通道配置
  {
    1,1
  }, //L9825Drv_swtUseUB_CA, L9825两块芯片的使能配置
  {
    0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15
  }, //PSWTDrv_idxChanSigConfUB_CA, 高低边驱动任务号配置，0~7为低边驱动，8~15为高边驱动
  65535, //SysCon_stIRevShuOffMaskUI_C
  65535, //SysCon_stRevShuOffMaskUI_C
  65535, //SysCon_stExtWaitMskUW_C，PostDrive状态等待结束的事件Mask
  65535, //SysCon_stExtWait2MskUW_C，PostDrive状态等待结束的事件Mask
  1000, //SysCon_tiPostDriveMaxUI_C，PostDrive最长时间，s
  1500, //SysCon_tiShutdownMaxUI_C，shutdown状态最长执行时间，s
  250, //SysCon_tiPostDriveMinUI_C，PostDrive最短时间，s
  {
    1,1,1
  }, //MSCANDrv_infoBaudrateUW_CA
  2000, //KWPCAN_tiToBMaxUW_C,ToB 最长时间50*100ms
  2000, //KWPCAN_tiToCMaxUW_C,ToC 最长时间50*100ms
  16, //KWPCAN_numFCWMaxUW_C,最多的Flow Control Wait Frame数目16
  "ECTEK1", //CCP_StationIdUB_CA
  0, //SigTst_bEnUW_C，是否直接控制9825和9362
  {
    0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
  }, //SigTst_bChanL9825UB_CA，各通道开关
  {
    500,500,500,500
  }, //SigTst_fChanL9825UI_CA，L9825各通道的PWM频率
  {
    0,0,0,0
  }, //SigTst_rChanL9825UW_CA，L9825各通道的占空比
  {
    0,0,0,0,0,0,0,0
  }, //SigTst_bChanBTS724UB_CA，高边驱动开关
  18428, //逻辑电上电电压限值
  {
    4,
    {
      0,5807,11613,20475
    },
    {
      0,1200,2400,4231
    }
  }, //蓄电池电压特性
};

volatile const VehicleMap_infoMap1S_TYPE VehicleMap_infoMap1S=
{
  "P156V100", //VehDataSet_idxSupervisorVerUB_CA，标准版本
  "10.0", //VehDataSet_idxUserVerUB_CA，用户版本
  0, //单值标定变量示例 触发EEPROM的存储
  {
    8,
    {
      0,2048,6143,8190,12285,16380,18428,20475
    },
    {
      0,5120,10240,15360,20480,25600,30720,35840
    }
  }, //曲线标定变量示例
  {
    8,
    4,
    {
      0,500,1000,1200,1400,1600,1800,2000
    },
    {
      0,1920,3200,4800
    },
    {
      0,0,0,0,
      0,0,0,0,
      0,0,0,0,
      0,0,0,0,
      0,0,0,0,
      0,0,0,0,
      0,0,0,0,
      0,0,0,0
    }
  }, //曲面标定变量示例
  "test", //字符串标定变量示例
  {
    1000,20,50,200
  }, //油门滤波百分比-0总数-1增量占比-2减量占比 3倒挡增量占比
  {
    19,5,17,106,0,2,16
  }, //整车控制帧-版本-日期-型号 D21 越博 蓝海华腾
  2, //车型定义 1 实验室驾驶舱 2 自制驾驶舱
  2000, //双油门差值极限 100倍 %
  1000, //油门刹车同时踩故障 最大油门值 0~100.00%
  50, //上电故障检测延迟 *10ms
  5, //油门故障检测延迟 *10ms
  120, //EPS通讯丢失超时 *10ms
  120, //行车状态通讯丢失超时 *10ms
  120, //车辆状态通讯丢失超时 *10ms
  120, //车辆制动状态通讯丢失超时 *10ms
  50, //模拟方向盘通讯丢失超时 *10ms
  5400, //EPS角度命令最大值 0.1°
  -5400, //EPS角度命令最小值 0.1°
  500, //远程制动j激活最小开度
  0, //方向盘编码器偏移
  0, //EPS角度偏移
  0, //远程驾驶模式DEBUG激活
  50, //D_Dang_Change_Delay_Index_Max
  5, //制动控制最小步进
  0, //Eps_AngleMaxSpeed
  50, //Auto_Hold_Delay_Max
  10, //Auto_Hold_Release_Torque
  64, //车辆速比
  1, //油门类型 1 双线 2 单线
  2, //制动类型  0：单路开关量 1：双路互反开关量  2：单路模拟量 3：双路模拟量
  {
    7,
    {
      0,614,655,1802,3686,3694,4095
    },
    {
      0,0,0,10000,10000,0,0
    }
  }, //油门开度
  {
    7,
    {
      0,655,860,3440,3604,3849,4095
    },
    {
      0,10000,10000,0,0,0,0
    }
  }, //油门开度2
  {
    11,
    {
      0,500,2000,3000,4000,5000,6000,7000,8000,9000,10000
    },
    {
      0,300,1100,1800,3000,4500,6000,7000,8000,9000,10000
    }
  }, //油门曲线
  {
    7,
    {
      0,614,2211,4013,4034,4054,4095
    },
    {
      0,0,0,10000,10000,10000,10000
    }
  }, //制动踏板深度
  {
    11,
    {
      0,500,2000,3000,4000,5000,6000,7000,8000,9000,10000
    },
    {
      0,1,2,3,5,7,10,15,20,25,30
    }
  }, //油门开度-加速度
  {
    11,
    {
      0,500,2000,3000,4000,5000,6000,7000,8000,9000,10000
    },
    {
      0,5,20,30,40,50,60,70,80,90,100
    }
  }, //制动深度-制动力给定%
  3000, //方向盘自检PWM占空比
  100, //方向盘自检堵转时间上限 10ms
  50, //方向盘死区角度
  70, //车辆速比
  4, //油门类型 1 双线 2 单线 4 CAN
  4, //制动类型  0：单路开关量 1：双路互反开关量  2：单路模拟量 3：双路模拟量    4:CAN
  {
    11,
    {
      0,500,2000,3000,4000,5000,6000,7000,8000,9000,10000
    },
    {
      0,300,1100,1800,3000,4500,6000,7000,8000,9000,10000
    }
  }, //油门曲线
  {
    11,
    {
      0,500,2000,3000,4000,5000,6000,7000,8000,9000,10000
    },
    {
      0,1,2,3,5,7,10,15,20,25,30
    }
  }, //油门开度-加速度
  {
    11,
    {
      0,500,2000,3000,4000,5000,6000,7000,8000,9000,10000
    },
    {
      0,-1,-2,-3,-5,-7,-10,-15,-20,-25,-30
    }
  }, //制动深度-制动力给定%
  {
    7,
    {
      0,9,10,25,235,240,255
    },
    {
      0,0,10000,10000,0,0,0
    }
  }, //油门曲线
  {
    7,
    {
      0,49,50,100,230,240,255
    },
    {
      0,0,10000,10000,0,0,0
    }
  }, //制动踏板曲线
  {
    7,
    {
      0,9,10,30,235,240,255
    },
    {
      0,0,10000,10000,0,0,0
    }
  }, //离合踏板曲线
  2000, //低门限
  5000, //高门限
  0, //Rtest_whee
  50, //Tag_Speed
  {
    9,
    {
      0,10,20,30,40,50,70,80,150
    },
    {
      500,300,200,100,0,-500,-1500,-2000,-2100
    }
  }, //Speed_To_Pwm_Add
  300000, //Fsetpwm
  {
    13,
    {
      -4000,-3600,-1800,-1200,-300,-50,0,50,300,1200,1800,3600,4000
    },
    {
      10000,8000,4000,4000,3000,2000,0,2000,3000,4000,4000,8000,10000
    }
  }, //回正力曲线
};

#pragma CONST_SEG DEFAULT

#pragma CONST_SEG __GPAGE_SEG DATA_VERIFY1
    volatile const HardwareMap_infoDataCheck1S_TYPE HardwareMap_infoDataCheck1S=
    {
        0x3D16,
        2019,
        5,
        22,
        0,
        10,
        29,
        7,
        "ECS-000-000.000-90-61-I-002.003"
    };
#pragma CONST_SEG DEFAULT

